#include <stdio.h>

// 位运算符：<<、按位与&、按位或|、异或^、按位非~
// 布尔型

int main() {

    // 1、<<
    int a = 6;
    int a1 = a << 1;
    printf("%d\n", a1);
    // 12
    /**
     << 是让所有的bit位进行左移操作，上面就是左移1位。同理也可以使用 >> 进行右移
     */


    // 2、按位与&
    int b = 4;
    int c = a & b;
    printf("%d\n", c);
    // 4
    /**
    b = 4 = 00000100
    a = 6 = 00000110
    按位与结果：00000100 = 4
     */


    // 3、按位或|
    // 略


    // 4、异或^
    int d = a ^ b;
    printf("%d\n", d);
    // 2
    /**
    b = 4 = 00000100
    a = 6 = 00000110
    异或结果：00000010 = 2
     */


    // 5、按位非~
    int e=~a;
    printf("%d\n",e);
    // -7
    /**
     a = 6 = 00000110
     e = ~a = 11111001（注意，这是补码）
     那么e的原码为：10000111 = -7
     * */


    // 布尔型
    _Bool boolean=1>0;
    printf("%d\n",boolean);
    // 1
    /**
     c语言的布尔值为0和1
     * */

    return 0;
}
